runs/case_11/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    Phi
    {
        solver      PCG;
        preconditioner DIC;
        tolerance   1e-06;
        relTol      0.01;
    }

    phi
    {
        solver      PCG;
        preconditioner DIC;
        tolerance   1e-06;
        relTol      0.01;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|k|omega|gammaInt|ReThetat)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent               yes;
}

relaxationFactors
{
    equations
    {
        U               0.5;
        k               0.5;
        omega           0.5;
        gammaInt        0.5;
        ReThetat        0.5;
    }
    fields
    {
        p               0.2;
    }
}
